package com.test.testTdd.chap11;

public class Description {
    
    /*
    테스트주도개발
    
    장점
    - 결함 감소
    - 스트레스 감소
    - 빠른 피드백
    
    중요한 점 
    - 꾸준히 ttd개발을 할 것
    
    ttd 적용 방법
    데이터를 조회해 엑셀 파일로 만들어서 제공
    
    기존 과정
    1. 디버깅 또는 코드 구현
    2. 톰캣 실행, 브라우저 실행
    3. 폼 이동, 폼 전송
    4. 에러 발생, 과정 1로 이동
    5. 다운로드한 엑셀 확인 후 이상 발견, 과정 1로 이동
    
    TDD 적용
    1. DB 조회 기능에 대한 테스트 작성 -> 통과할 때까지 구현
    2. 엑셀 파일 생성하는 코드에 대한 테스트 작성 -> 통과할 때까지 구현
    3. 컨트롤러에서 파일 다운로드 처리 테스트 작성 -> 통과할 때까지 구현
    4. 톰캣 구동하고 브라우저 실행해서 테스트 진행
     */
}
