package com.test.testTdd.chap09;

public class Description {
    
    /*
    테스트 범위 종류
        - 단위 테스트 (서비스, 모델)
        - 통합 테스트 (웹 서버, DB)
        - 기능 테스트 (프런트 포함)

    기능 테스트
        - 사용자 입장에서 시스템이 제공하는 기능이 올바르게 동작하느지 확인
        - 모든 구성이 필요 ( ex) 회원가입의 경우 웹브라우저, 웹서버, 데이터베이스)

    통합 테스트
        - 시스템의 각 구성 요소가 올바르게 연동되는지 확인
        - 소프트웨어의 코드를 직접 테스트
        - 웹 어플리케이션
        
    단위 테스트
        - 개별 코드나 컴포넌트가 기대한대로 동작하는지 확인
        - 한 테스트나 한 메서드와 같이 작은 범위를 확인
        
    테스트 코드는 단위 테스트와 통합 테스트를 섞어서 작성
        - 통합 테스트보단 단위 테스트를 더 많이 작성
        - 단위 테스트에선 다양한 상황을 다루고 통합 테스트나 기능 테스트는 주요 상황에 대해 작성
    * */
}
